# A dependency manifest for Homebrew
#
# Install dependencies using this file with the following command:
#
#     brew bundle --verbose --no-upgrade
#
# If you wish to upgrade all dependencies specified here, run the following:
#
#     brew bundle --verbose
#
# Walkthrough blog post explaining this tool:
# https://thoughtbot.com/blog/brewfile-a-gemfile-but-for-homebrew

# Tools
brew "coreutils"
brew "tree"
brew "jq"
brew "jc"
brew "watch"
brew "ripgrep"
brew "vim"
brew "virtualenv"
brew "fzf"
brew "fd"
brew "b3sum"
brew "tmux"
brew "wget"
brew "just"
brew "autoconf"
brew "gnupg"
brew "direnv"
brew "pinentry-mac"
brew "testdisk"
brew "sqlite"
brew "imagemagick"
brew "shellcheck"
brew "graphviz"
brew "yt-dlp"
brew "llm"
brew "mas"
brew "hugo"
brew "caddy"

# Languages
brew "python"
brew "go"
brew "node"
brew "uv"
brew "ruff"

# SCM
brew "git"
brew "git-lfs"
brew "git-absorb"
brew "gh"

# Apps
cask "istat-menus"
cask "zotero"
cask "calibre"
cask "1password-cli"
cask "wireshark"
cask "tailscale"
cask "anki"
cask "zed"
mas "Evernote", id: 406056744
mas "Remote Desktop", id: 409907375
mas "Kindle", id: 302584613
mas "Kiwix", id: 997079563

mas "Affinity Photo 2", id: 1616822987
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Publisher 2", id: 1606941598
mas "Final Cut Pro", id: 424389933
mas "Compressor", id: 424390742

mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704

# Install Inconsolata font
cask "font-inconsolata"

# Google Cloud
cask "google-cloud-sdk"

# Install Hashicorp tools
# https://github.com/hashicorp/homebrew-tap#why-should-i-install-packages-from-this-tap
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/nomad"
