# A dependency manifest for Homebrew
#
# Install dependencies using this file with the following command:
#
#     brew bundle --verbose --no-upgrade
#
# If you wish to upgrade all dependencies specified here, run the following:
#
#     brew bundle --verbose
#
# Walkthrough blog post explaining this tool:
# https://thoughtbot.com/blog/brewfile-a-gemfile-but-for-homebrew

brew "coreutils"
brew "tree"
brew "jq"
brew "jc"
brew "watch"
brew "ripgrep"
brew "vim"
brew "go"
brew "python"
brew "virtualenv"
brew "pipx"
brew "node"
brew "fzf"
brew "fd"
brew "b3sum"
brew "tmux"
brew "wget"
brew "git"
brew "git-lfs"
brew "git-absorb"
brew "gh"
brew "just"
brew "autoconf"
brew "gnupg"
brew "direnv"
brew "pinentry-mac"
brew "testdisk"
brew "sqlite"
brew "imagemagick"
brew "shellcheck"
brew "graphviz"
brew "llm"

# Install Inconsolata font
tap "homebrew/cask-fonts"
cask "font-inconsolata"

# Google Cloud
cask "google-cloud-sdk"

# Install Hashicorp tools
# ref: https://github.com/hashicorp/homebrew-tap#why-should-i-install-packages-from-this-tap
tap "hashicorp/tap"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/nomad"
